"""
Напишите программу, которая принимает на вход возраст человека (количество полных лет) и выводит сколько лет
ему исполнится в следующем году
"""
# version 1
# year_people = int(input())
# year_people += 1
# print(year_people)
#
# # version 2
# print(int(input()) + 1)

"""
Вашей программе поступает на вход натуральное число. Ваша задача вывести в отдельных строках:
число, увеличенное в 2 раза;
число, уменьшенное в 2 раза
"""

# a = int(input())
# print(a * 2, a / 2, sep='\n')

"""
Я думаю каждый знаком с квадратом - идеально симметричная и ровная фигура. Давайте напишем программу,
 которая вычисляет площадь квадрата по введенной длине.
"""
# a = float(input())
# print(a ** 2)

"""
Напишите программу, которая принимает на вход два целых числа в отдельных строках и выводит на экран их сумму.
"""
# a = int(input())
# b = int(input())
# print(a + b)

# print(int(input()) + int(input()))

"""
В этом задании необходимо написать программу, которая вычисляет площадь и периметр прямоугольника по введенной длине и ширине.
"""

# a, b = float(input()), float(input())
# print(a * b, 2 * (a + b))


"""
Из Фаренгейтов в градусы Цельсия
"""
# temperature_fahrenheit = float(input('Введите темпиратуру: '))
# print((temperature_fahrenheit - 32) * 5 / 9)


"""
Найдите результат выражения ∣a∣+∣b∣
Значения переменных а и b поступают на вход в отдельных строках и могут быть только целого типа
"""
# a, b = int(input()), int(input())
# print(abs(a) + abs(b))

"""
Напишите программу, которая вычисляет длину отрезка (т.е. расстояние между двумя точками), заданного двумя значениями x1 и x2 (вещественные числа).
"""
# a, b = float(input()), float(input())
# print(abs(a - b))

"""
Вводится вещественное число и нам нужно его округлить до 2 и 3 разряда после запятой и вывести полученный результат через пробел в одной строчке
"""
# a = float(input())
# print(round(a, 2), round(a, 3))

