'''
Напишите программу, которая распечатает все натуральные числа от 1000 до 2000 включительно.

Каждое число следует выводить на отдельной строчке как в примере ниже
'''
n = 999
while n < 2000:
    n += 1
    print(n)

